// var data = [{
//     hot: ['鸳鸯戏水', '干锅土豆', '麻辣小龙虾', '清蒸鲈鱼'],
//     menu: [{
//         name: '米饭',
//         types: [{
//             name: '营养粥',
//             item: ['皮蛋瘦肉粥', '玉米排骨粥', '青菜瘦肉粥', '八宝粥', '白粥', '红豆粥', '绿豆粥', '红薯粥', '南瓜粥', '杏仁核桃粥']
//         }, {
//             name: '煲仔饭',
//             item: ['红烧鸡块煲仔饭', '黑椒牛柳煲仔饭', '三鲜菌菇煲仔饭']
//         }, {
//             name: '盖浇饭',
//             item: ['红烧鸡块盖浇饭', '黑椒牛柳盖浇饭', '三鲜菌菇盖浇饭', '青椒肉丝盖浇饭', '土豆鸡块盖浇饭']
//         }, {
//             name: '炒饭',
//             item: ['红烧鸡块炒饭', '黑椒牛柳盖浇饭炒饭', '三鲜菌菇炒饭', '青椒肉丝炒饭', '土豆鸡块炒饭', '蛋炒饭', '扬州炒饭', '兰州炒饭', '老干妈炒饭']
//         }]
//     }, {
//         name: '面条',
//         types: [{
//             name: '炒面',
//             item: ['红烧鸡块炒面', '黑椒牛柳炒面', '三鲜菌菇炒面']
//         }, {
//             name: '汤面',
//             item: ['红烧鸡块汤面', '黑椒牛柳汤面', '三鲜菌菇汤面', '青椒肉丝汤面', '土豆鸡块汤面']
//         }]
//     }, {
//         name: '炒菜',
//         types: [{
//             name: '赣菜',
//             item: ['红烧鸡块煲仔饭', '黑椒牛柳煲仔饭', '三鲜菌菇煲仔饭']
//         }, {
//             name: '川菜',
//             item: ['麻婆豆腐', '宫保鸡丁', '红烧狮子头', '蚂蚁上树', '爆炒牛腩']
//         }, {
//             name: '湘菜',
//             item: ['麻婆豆腐', '宫保鸡丁', '红烧狮子头', '蚂蚁上树', '爆炒牛腩', '麻婆豆腐', '宫保鸡丁', '红烧狮子头', '蚂蚁上树', '爆炒牛腩', '麻婆豆腐', '宫保鸡丁', '红烧狮子头', '蚂蚁上树', '爆炒牛腩']
//         }]
//     }]
// }];





var hotJobs = {
    "code": 200,
    "data": [{
            "id": 85,
            "uid": 131312,
            "name": "清炖蟹粉狮子头",
            "pid": 131300,
            "level": 3,
        },
        {
            "id": 49,
            "uid": 121212,
            "name": "卤肉饭",
            "pid": 121200,
            "level": 3,
        },
        {
            "id": 78,
            "uid": 131214,
            "name": "飘香鲫鱼",
            "pid": 131200,
            "level": 3,
        },
        {
            "id": 79,
            "uid": 131215,
            "name": "臭鳜鱼",
            "pid": 131200,
            "level": 3,
        },
    ]
}
var jobs = {
    "status": true,
    "info": [{
            "id": 1,
            "uid": 110000,
            "name": "面条",
            "pid": 0,
            "level": 1,
            "children": [{
                    "id": 2,
                    "uid": 111200,
                    "name": "炒面",
                    "pid": 110000,
                    "level": 2,
                    "children": [{
                            "id": 3,
                            "uid": 111212,
                            "name": "鸡蛋炒面",
                            "pid": 111200,
                            "level": 3,
                        },
                        {
                            "id": 4,
                            "uid": 111213,
                            "name": "牛肉炒面",
                            "pid": 111200,
                            "level": 3,
                        },
                        {
                            "id": 5,
                            "uid": 111214,
                            "name": "香肠炒面",
                            "pid": 111200,
                            "level": 3,
                        },
                        {
                            "id": 6,
                            "uid": 111215,
                            "name": "培根炒面",
                            "pid": 111200,
                            "level": 3,
                        },
                        {
                            "id": 7,
                            "uid": 111216,
                            "name": "青菜炒面",
                            "pid": 111200,
                            "level": 3,
                        },
                        {
                            "id": 8,
                            "uid": 111217,
                            "name": "火腿炒面",
                            "pid": 111200,
                            "level": 3,
                        },
                        {
                            "id": 9,
                            "uid": 111218,
                            "name": "洋葱炒面",
                            "pid": 111200,
                            "level": 3,
                        },
                        {
                            "id": 10,
                            "uid": 111219,
                            "name": "鸡肉炒菜",
                            "pid": 111200,
                            "level": 3,
                        },
                        {
                            "id": 11,
                            "uid": 111220,
                            "name": "卤肉炒面",
                            "pid": 111200,
                            "level": 3,
                        },
                        {
                            "id": 12,
                            "uid": 111221,
                            "name": "爆鱼炒面",
                            "pid": 111200,
                            "level": 3,
                        },
                        {
                            "id": 13,
                            "uid": 111222,
                            "name": "鸭蛋炒面",
                            "pid": 111200,
                            "level": 3,
                        },
                        {
                            "id": 14,
                            "uid": 111223,
                            "name": "酱油炒面",
                            "pid": 111200,
                            "level": 3,
                        },
                    ]
                },
                {
                    "id": 21,
                    "uid": 111300,
                    "name": "汤面",
                    "pid": 110000,
                    "level": 2,
                    "children": [{
                            "id": 22,
                            "uid": 111312,
                            "name": "青菜面",
                            "pid": 111300,
                            "level": 3,
                        },
                        {
                            "id": 23,
                            "uid": 111313,
                            "name": "西红柿鸡蛋面",
                            "pid": 111300,
                            "level": 3,
                        },
                        {
                            "id": 24,
                            "uid": 111314,
                            "name": "牛肉面",
                            "pid": 111300,
                            "level": 3,
                        },
                        {
                            "id": 25,
                            "uid": 111315,
                            "name": "红烧牛肉面",
                            "pid": 111300,
                            "level": 3,
                        },
                        {
                            "id": 26,
                            "uid": 111316,
                            "name": "排骨面",
                            "pid": 111300,
                            "level": 3,
                        },
                        {
                            "id": 27,
                            "uid": 111317,
                            "name": "大排面",
                            "pid": 111300,
                            "level": 3,
                        },
                        {
                            "id": 28,
                            "uid": 111318,
                            "name": "爆鱼面",
                            "pid": 111300,
                            "level": 3,
                        },
                        {
                            "id": 29,
                            "uid": 111319,
                            "name": "虾仁面",
                            "pid": 111300,
                            "level": 3,
                        },
                        {
                            "id": 30,
                            "uid": 111320,
                            "name": "卤肉面",
                            "pid": 111300,
                            "level": 3,
                        }
                    ]
                },
            ]
        },
        {
            "id": 47,
            "uid": 120000,
            "name": "米饭",
            "pid": 0,
            "level": 1,
            "children": [{
                    "id": 48,
                    "uid": 121200,
                    "name": "快餐",
                    "pid": 120000,
                    "level": 2,
                    "children": [{
                            "id": 49,
                            "uid": 121212,
                            "name": "卤肉饭",
                            "pid": 121200,
                            "level": 3,
                        },
                        {
                            "id": 50,
                            "uid": 121213,
                            "name": "鸡腿饭",
                            "pid": 121200,
                            "level": 3,
                        },
                        {
                            "id": 51,
                            "uid": 121214,
                            "name": "鸭腿饭",
                            "pid": 121200,
                            "level": 3,
                        },
                        {
                            "id": 52,
                            "uid": 121215,
                            "name": "大排饭",
                            "pid": 121200,
                            "level": 3,
                        },
                        {
                            "id": 53,
                            "uid": 121216,
                            "name": "排骨菜饭",
                            "pid": 121200,
                            "level": 3,
                        },
                        {
                            "id": 54,
                            "uid": 121217,
                            "name": "酱香牛肉饭",
                            "pid": 121200,
                            "level": 3,
                        },
                    ]
                },
                {
                    "id": 57,
                    "uid": 121300,
                    "name": "炒饭",
                    "pid": 120000,
                    "level": 2,
                    "children": [{
                            "id": 58,
                            "uid": 121312,
                            "name": "蛋炒饭",
                            "pid": 121300,
                            "level": 3,
                        },
                        {
                            "id": 59,
                            "uid": 121313,
                            "name": "扬州炒饭",
                            "pid": 121300,
                            "level": 3,
                        },
                        {
                            "id": 60,
                            "uid": 121314,
                            "name": "香肠炒饭",
                            "pid": 121300,
                            "level": 3,
                        },
                        {
                            "id": 61,
                            "uid": 121315,
                            "name": "培根炒饭",
                            "pid": 121300,
                            "level": 3,
                        }
                    ]
                },
            ]
        },
        {
            "id": 74,
            "uid": 130000,
            "name": "炒菜",
            "pid": 0,
            "level": 1,
            "children": [{
                    "id": 75,
                    "uid": 131200,
                    "name": "湘菜",
                    "pid": 130000,
                    "level": 2,
                    "children": [{
                            "id": 76,
                            "uid": 131212,
                            "name": "鱼香肉丝",
                            "pid": 131200,
                            "level": 3,
                        },
                        {
                            "id": 77,
                            "uid": 131213,
                            "name": "手撕鸡",
                            "pid": 131200,
                            "level": 3,
                        },
                        {
                            "id": 78,
                            "uid": 131214,
                            "name": "飘香鲫鱼",
                            "pid": 131200,
                            "level": 3,
                        },
                        {
                            "id": 79,
                            "uid": 131215,
                            "name": "臭鳜鱼",
                            "pid": 131200,
                            "level": 3,
                        },
                        {
                            "id": 80,
                            "uid": 131216,
                            "name": "铁锅葱烧虾",
                            "pid": 131200,
                            "level": 3,
                        },
                        {
                            "id": 81,
                            "uid": 131217,
                            "name": "香辣鱿鱼虾",
                            "pid": 131200,
                            "level": 3,
                        },
                        {
                            "id": 82,
                            "uid": 131218,
                            "name": "干锅花猪肉烧鸡",
                            "pid": 131200,
                            "level": 3,
                        },
                        {
                            "id": 83,
                            "uid": 131219,
                            "name": "川香回锅肉",
                            "pid": 131200,
                            "level": 3,
                        }
                    ]
                },
                {
                    "id": 84,
                    "uid": 131300,
                    "name": "淮扬菜",
                    "pid": 130000,
                    "level": 2,
                    "children": [{
                            "id": 85,
                            "uid": 131312,
                            "name": "清炖蟹粉狮子头",
                            "pid": 131300,
                            "level": 3,
                        },
                        {
                            "id": 86,
                            "uid": 131313,
                            "name": "文思豆腐",
                            "pid": 131300,
                            "level": 3,
                        },
                        {
                            "id": 87,
                            "uid": 131314,
                            "name": "迷你八宝葫芦鸭",
                            "pid": 131300,
                            "level": 3,
                        },
                    ]
                },
                {
                    "id": 88,
                    "uid": 131400,
                    "name": "徽菜",
                    "pid": 130000,
                    "level": 2,
                    "children": [{
                            "id": 89,
                            "uid": 131412,
                            "name": "臭鳜鱼",
                            "pid": 131400,
                            "level": 3,
                        },
                        {
                            "id": 90,
                            "uid": 131413,
                            "name": "清蒸石鸡",
                            "pid": 131400,
                            "level": 3,
                        }
                    ]
                }
            ]
        },
    ],
    "msg": null
}


console.log(jobs)
console.log(hotJobs)
